In [39]:
import pandas as pd

Particularmente prefiro fazer esses filtros em SQL, acho mais simples de implementar e mais limpo.

In [40]:
# Criação df emula a tabela da questão
customer_orders = pd.DataFrame({
    "order_id": [1, 2, 4, 5],
    "customer_name": ["Alex", "Carol", "Dani", "Janete"],
    "customer_id": [10, 11, 12, 13]
})

In [41]:
customer_orders.head()

   order_id customer_name  customer_id
0         1          Alex           10
1         2         Carol           11
2         4          Dani           12
3         5        Janete           13

In [42]:
# Criação df emula a tabela da questão
address_details = pd.DataFrame({
    "order_id": [1, 2, 4],
    "address": ["Florianopolis", "Ita", "Toledo"],
    "state": ["SC", "SC", "PR"],
    "country": ["BR", "BR",  "BR"],
    "zip_code": ["88034101", "88034-102", "8976000"]

})

In [43]:
address_details

   order_id        address state country   zip_code
0         1  Florianopolis    SC      BR   88034101
1         2            Ita    SC      BR  88034-102
2         4         Toledo    PR      BR    8976000

In [44]:
# Merge dos dois df baseado quando a coluna order_id dos dois forem iguais
df_merged = pd.merge(customer_orders, address_details, on='order_id', how='inner')

In [45]:
df_merged.head()

   order_id customer_name  customer_id        address state country   zip_code
0         1          Alex           10  Florianopolis    SC      BR   88034101
1         2         Carol           11            Ita    SC      BR  88034-102
2         4          Dani           12         Toledo    PR      BR    8976000

In [46]:
# Após a junção dos df a aplicação dos filtros where da query. 
# Quando o campo tem mais ou igual a 5 caracteres e o segundo
# um campo sem traços, vazio ou com endereço não valido
df_filtred = df_merged[(df_merged['address'].str.len() >= 5) & 
                        (~df_merged['address'].isin(['-', '', 'SOME ADDRESS']))]

In [47]:
df_filtred

   order_id customer_name  customer_id        address state country  zip_code
0         1          Alex           10  Florianopolis    SC      BR  88034101
2         4          Dani           12         Toledo    PR      BR   8976000

In [48]:
# Por último a ordenão de maneira crescente
df_order = df_filtred.sort_values(by='order_id')

In [49]:
df_order

   order_id customer_name  customer_id        address state country  zip_code
0         1          Alex           10  Florianopolis    SC      BR  88034101
2         4          Dani           12         Toledo    PR      BR   8976000